//: Playground - noun: a place where people can play

import UIKit
import PySwiftyRegex

//: # \d: 半角数字


let target = "名前：伊藤淳一" +
    "電話：03-1234-5678" +
"住所：兵庫県西脇市板波町1-2-3"


//: ## 1個
re.findall("\\d", target)

//: ## 電話番号
re.search("\\d\\d-\\d\\d\\d\\d-\\d\\d\\d\\d", target)?.group()
//: ## 電話番号(改良)
re.search("\\d{2,5}-\\d{1,4}-\\d{4}", target)?.group()

//: ## 電話番号(括弧にも対応)
re.search("\\d{2,5}[-(]\\d{1,4}[-)]\\d{4}", target)?.group()
let target2 = "名前：伊藤淳一" +
    "電話：03(1234)5678" +
"住所：兵庫県西脇市板波町1-2-3"
re.search("\\d{2,5}[-(]\\d{1,4}[-)]\\d{4}", target2)?.group()
//: **半角の丸カッコ（ ( と ) ）は、[ ] の外で使われると特別な意味を持つので注意**

//: # []中のハイフン

let target3 = "名前：伊藤淳一" +
"電話：03(1234)5678" +
"電話：090-1234-5678" +
"電話：0795(12)3456" +
"電話：04992-1-2345" +
"住所：兵庫県西脇市板波町1-2-3"

//: ## -で連結させるとその間の文字
re.findall("[0-9]", target3)

//: ## -で始めると特別な意味が無くなる
re.findall("[-09]", target3)

//: # 精度改善

let target4 = "名前：伊藤淳一" +
"電話：03(1234)5678" +
"？？：9999-99-9999" +
"？？：03(1234-5678" +
"住所：兵庫県西脇市板波町1-2-3"

re.findall("0[1-9]\\d{0,3}[-(]\\d{1,4}[-)]\\d{4}", target4)

//: [Next](@next)


